What is Data Science?
Data Science or Data Analytics is process of analyzing large set of data points to get answers on questions related to that data.

*-------Different Ways to Load data into DataFrame----------*

In [1]:
import pandas as pd

In [12]:
# Directly import data from file
Direct_df = pd.read_csv('../Sample Data/W_1.csv')
# Direct_df = pd.read_excel('filepath',sheet_name='Name of Sheet')        If you have excel file
Direct_df

        Day  Temperature  Windspeed  Event
0  1/1/2017         32.0        7.0   Rain
1  1/2/2017         35.0        7.0  Sunny
2  1/3/2017         34.0        8.0   Snow
3  1/4/2017         33.0        6.0   Snow
4  1/5/2017         31.0        5.0  Sunny
5  1/6/2017         30.0        2.0   Rain
6       NaN          NaN        NaN    NaN
7       NaN          NaN        NaN    NaN

In [13]:
# Create data frame from Dictionary
weather = {
     'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed':[6,7,2,7,4,2],	
    'event':['Rain','Sunny','Snow','Snow','Rain','Sunny'] }

Dict_df = pd.DataFrame(weather)

Dict_df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [53]:
# Dataframe from tuple list
weather_tuple = [ 
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny')
]

Tuple_df = pd.DataFrame(weather_tuple,columns=['Day','Temperature','Windspeed','Event'])

*-------------Initial Step need after set DataFrame-------------*

In [15]:
# Shape of DataFrame
Direct_df.shape    # Result is Tuple

(8, 4)

In [16]:
# Print First 5 and last rows
Direct_df.head()
Direct_df.tail()

        Day  Temperature  Windspeed  Event
3  1/4/2017         33.0        6.0   Snow
4  1/5/2017         31.0        5.0  Sunny
5  1/6/2017         30.0        2.0   Rain
6       NaN          NaN        NaN    NaN
7       NaN          NaN        NaN    NaN

In [17]:
# Information about Dataframe
Direct_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          6 non-null      object
 1   Temperature  6 non-null      float64
 2   Windspeed    6 non-null      float64
 3   Event        6 non-null      object
dtypes: float64(2), object(2)
memory usage: 384.0+ bytes

In [18]:
# Type of column dataframe
Direct_df.dtypes

Day             object
Temperature    float64
Windspeed      float64
Event           object
dtype: object

In [20]:
# Size of Dataframe
Direct_df.size

32

In [21]:
# List of Columns in Dataframe
Direct_df.columns

Index(['Day', 'Temperature', 'Windspeed', 'Event'], dtype='object')

In [23]:
# Printing Columns
Direct_df[['Day']]   # Two [] give output in nicer way

        Day
0  1/1/2017
1  1/2/2017
2  1/3/2017
3  1/4/2017
4  1/5/2017
5  1/6/2017
6       NaN
7       NaN

In [24]:
# printing few column
Direct_df[['Day','Event']]

        Day  Event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017  Sunny
5  1/6/2017   Rain
6       NaN    NaN
7       NaN    NaN

In [26]:
# Printing column with condition
Direct_df[['Day','Temperature']][Direct_df['Temperature'] > 32]

        Day  Temperature
1  1/2/2017         35.0
2  1/3/2017         34.0
3  1/4/2017         33.0

In [28]:
# Multiple condition
Direct_df[['Day','Temperature','Event']][(Direct_df['Temperature'] > 32) & (Direct_df['Event'] == 'Sunny')]

        Day  Temperature  Event
1  1/2/2017         35.0  Sunny

In [30]:
#Inbulit function
Direct_df['Temperature'].max()        #max()  min()   sum()  mean() mode() std()  etc

35.0

In [31]:
#Getting index
Direct_df.index

RangeIndex(start=0, stop=8, step=1)

In [46]:
# Set column as index
Direct_df.set_index('Day',inplace=True)

In [45]:
  # Reset index
Direct_df.reset_index(inplace=True)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [51]:
Direct_df.loc['1/1/2017']    # Get row by particular index

index             0
Temperature    32.0
Windspeed       7.0
Event          Rain
Name: 1/1/2017, dtype: object

*-----------------------Read/Write in CSV/Exel File-------------*

In [55]:
c_data = pd.read_csv('../Sample Data/Company.csv',
                         header=None,                                          # Does not set first row as Header
                        names=['tickers','eps','revenue','price','people'],    # provide Header manually
                        na_values={'eps':['not available','n.a.'],             # Set NaN for given set of value
                                    'revenue':[-1],
                                    'price':['n.a.'], 
                                    'people':['n.a.']} )

In [58]:
c_data

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [ ]:
# If first some row in Dataset is empty and you want to skip it
#    pd.read_csv('../Sample Data/Company.csv',skiprows = Number of row you want to skip)
 #   pd.read_csv('../Sample Data/Company.csv',header=Row number you want to set as header)

In [ ]:
# If you want read few row
# pd.read_csv('../Sample Data/Company.csv',nrows = Number of rows you want to read)

In [60]:
# Write in to csv
c_data.to_csv('filename.csv',index=False)

# Write some column 
# c_data.to_csv('filename.csv', columns=[list of columns you want to save]index=False)

In [62]:
# Save two Dataframe in one Excel file

with pd.ExcelWriter('Stock_Weather.xlsx') as writer:
    Direct_df.to_excel(writer,sheet_name='Weather',index=False)
    c_data.to_excel(writer,sheet_name='Stocks',index=False)

*---------------Handling Missing Data with fillna,dropna,interpolate function --------*

In [64]:
Miss_Data = pd.read_csv('../Sample Data/Miss_Data.csv',parse_dates=['day'])     # parse_dates set date column type as timestamp

In [65]:
Miss_Data.head()

         day  temperature  windspeed  event
0 2016-01-01         38.0        6.0   Rain
1 2016-01-04          NaN        9.0  Sunny
2 2016-01-05         28.0        NaN   Snow
3 2016-01-06          NaN        7.0    NaN
4 2016-01-07         32.0        NaN   Rain

In [66]:
Miss_Data.set_index('day',inplace=True)

In [67]:
# Fill NaN with some value
New_df = Miss_Data.fillna(0)            # Replace NaN with 0

In [68]:
New_df

            temperature  windspeed   event
day
2016-01-01         38.0        6.0    Rain
2016-01-04          0.0        9.0   Sunny
2016-01-05         28.0        0.0    Snow
2016-01-06          0.0        7.0       0
2016-01-07         32.0        0.0    Rain
2016-01-08          0.0        0.0   Sunny
2016-01-09          0.0        0.0       0
2016-01-10         34.0        8.0  Cloudy
2016-01-11         40.0       12.0   Sunny

In [69]:
New_df = Miss_Data.fillna(
    {
        'temperature':0, 
        'windspeed':0, 
        'event':'No Event'
    }
)

In [70]:
New_df

            temperature  windspeed     event
day
2016-01-01         38.0        6.0      Rain
2016-01-04          0.0        9.0     Sunny
2016-01-05         28.0        0.0      Snow
2016-01-06          0.0        7.0  No Event
2016-01-07         32.0        0.0      Rain
2016-01-08          0.0        0.0     Sunny
2016-01-09          0.0        0.0  No Event
2016-01-10         34.0        8.0    Cloudy
2016-01-11         40.0       12.0     Sunny

In [72]:
# Fill NaN with ffill and bfill  caryy forward value from previous or next value
New_df = Miss_Data.fillna(method='ffill')
# New_df = Miss_Data.fillna(method='bfill)
New_df

            temperature  windspeed   event
day
2016-01-01         38.0        6.0    Rain
2016-01-04         38.0        9.0   Sunny
2016-01-05         28.0        9.0    Snow
2016-01-06         28.0        7.0    Snow
2016-01-07         32.0        7.0    Rain
2016-01-08         32.0        7.0   Sunny
2016-01-09         32.0        7.0   Sunny
2016-01-10         34.0        8.0  Cloudy
2016-01-11         40.0       12.0   Sunny

In [80]:
# Argument with ffill
New_df = Miss_Data.fillna(method='ffill',limit=1)

In [81]:
New_df

            temperature  windspeed   event
day
2016-01-01         38.0        6.0    Rain
2016-01-04         38.0        9.0   Sunny
2016-01-05         28.0        9.0    Snow
2016-01-06         28.0        7.0    Snow
2016-01-07         32.0        7.0    Rain
2016-01-08         32.0        NaN   Sunny
2016-01-09          NaN        NaN   Sunny
2016-01-10         34.0        8.0  Cloudy
2016-01-11         40.0       12.0   Sunny

In [83]:
# Interpolate Method 
New_df = Miss_Data.interpolate()

In [84]:
New_df

            temperature  windspeed   event
day
2016-01-01    38.000000       6.00    Rain
2016-01-04    33.000000       9.00   Sunny
2016-01-05    28.000000       8.00    Snow
2016-01-06    30.000000       7.00     NaN
2016-01-07    32.000000       7.25    Rain
2016-01-08    32.666667       7.50   Sunny
2016-01-09    33.333333       7.75     NaN
2016-01-10    34.000000       8.00  Cloudy
2016-01-11    40.000000      12.00   Sunny

In [85]:
New_df = Miss_Data.interpolate(method='time')

In [86]:
New_df

            temperature  windspeed   event
day
2016-01-01    38.000000       6.00    Rain
2016-01-04    30.500000       9.00   Sunny
2016-01-05    28.000000       8.00    Snow
2016-01-06    30.000000       7.00     NaN
2016-01-07    32.000000       7.25    Rain
2016-01-08    32.666667       7.50   Sunny
2016-01-09    33.333333       7.75     NaN
2016-01-10    34.000000       8.00  Cloudy
2016-01-11    40.000000      12.00   Sunny

In [88]:
# Drop Missing Values
 # Drop Row which has NaN values
New_df = Miss_Data.dropna()    
New_df

            temperature  windspeed   event
day
2016-01-01         38.0        6.0    Rain
2016-01-10         34.0        8.0  Cloudy
2016-01-11         40.0       12.0   Sunny

In [90]:
# Drp row if it has all NaN
New_df = Miss_Data.dropna(how='all')
New_df

            temperature  windspeed   event
day
2016-01-01         38.0        6.0    Rain
2016-01-04          NaN        9.0   Sunny
2016-01-05         28.0        NaN    Snow
2016-01-06          NaN        7.0     NaN
2016-01-07         32.0        NaN    Rain
2016-01-08          NaN        NaN   Sunny
2016-01-10         34.0        8.0  Cloudy
2016-01-11         40.0       12.0   Sunny

In [93]:
# Drop column based on non NaN values 
New_df = Miss_Data.dropna(thresh=1)     # row has at least one value than keep it.

In [94]:
New_df

            temperature  windspeed   event
day
2016-01-01         38.0        6.0    Rain
2016-01-04          NaN        9.0   Sunny
2016-01-05         28.0        NaN    Snow
2016-01-06          NaN        7.0     NaN
2016-01-07         32.0        NaN    Rain
2016-01-08          NaN        NaN   Sunny
2016-01-10         34.0        8.0  Cloudy
2016-01-11         40.0       12.0   Sunny

*-----------------Replace Method to Deal With Missing Data--------------*

In [ ]:
# Replace particular value
# df.replace(-99999,np.NaN)

In [ ]:
# Replace Number of values
# df.replace([list of values],np.NaN)

In [ ]:
# Replace different value in different values
#df.replace({
#             'ColumnName': value which need to replaced
#               }
#            ,np.NaN)

In [ ]:
#replace value with specific values
#        df.replace({
#          -99999: np.NaN,
#           'No event': 'Sunny'
#               })

In [98]:
Regex_data = pd.read_csv('W_1.csv')
Regex_data

        Day Temperature Windspeed  Event
0  1/1/2017        32 f     7 mph   Rain
1  1/2/2017          35         7  Sunny
2  1/3/2017        34 c         8   Snow
3  1/4/2017          33         6   Snow
4  1/5/2017          31     5 kph  Sunny
5  1/6/2017          30         2   Rain

In [102]:
# Remove some Unit String from Numeric Column

Regex_data_replace = Regex_data.replace({
    'Temperature':'[A-Za-z]', 
    'Windspeed':'[A-Za-z]'
},'',regex=True)

In [103]:
Regex_data_replace

        Day Temperature Windspeed  Event
0  1/1/2017         32         7    Rain
1  1/2/2017          35         7  Sunny
2  1/3/2017         34          8   Snow
3  1/4/2017          33         6   Snow
4  1/5/2017          31        5   Sunny
5  1/6/2017          30         2   Rain

In [ ]:
# Replace list of values with another list of values
# df.replace([values want to replace],[values which get replaced])

*-------------------Group By Function----------------------*

In [105]:
Food = pd.read_csv('../Sample Data/Food_COuntry.csv')

In [106]:
Food

,date,region,beverages_units,food_units,electronics_units,clothes_units,tools_units
0,6/1/2020,SIN51,194,188,68,93,261
1,-,DUB53,28,149,141,111,207
2,-,IAD77,83,154,33,211,143
3,-,PDX79,56,21,87,27,274
4,6/2/2020,SIN51,118,12,10,150,152
...,...,...,...,...,...,...,...
115,-,PDX79,44,157,38,101,49
116,6/30/2020,SIN51,158,109,25,17,45
117,-,DUB53,14,2,11,11,38
118,-,IAD77,21,38,47,78,2
119,-,PDX79,105,165,43,135,8

In [116]:
import numpy as np
Food_replace = Food.replace({
    'date': '-'
},np.NaN)

Food_replace.head()

,date,region,beverages_units,food_units,electronics_units,clothes_units,tools_units
0,6/1/2020,SIN51,194,188,68,93,261
1,NaN,DUB53,28,149,141,111,207
2,NaN,IAD77,83,154,33,211,143
3,NaN,PDX79,56,21,87,27,274
4,6/2/2020,SIN51,118,12,10,150,152

In [119]:
Food_Fill = Food_replace.fillna(method='ffill')

In [120]:
Food_Fill.head()

,date,region,beverages_units,food_units,electronics_units,clothes_units,tools_units
0,6/1/2020,SIN51,194,188,68,93,261
1,6/1/2020,DUB53,28,149,141,111,207
2,6/1/2020,IAD77,83,154,33,211,143
3,6/1/2020,PDX79,56,21,87,27,274
4,6/2/2020,SIN51,118,12,10,150,152

In [169]:
Food_Fill.groupby(['region'])[['beverages_units','food_units','electronics_units','clothes_units','tools_units']].agg(np.sum)

,beverages_units,food_units,electronics_units,clothes_units,tools_units
region,,,,,
DUB53,2093,2497,2275,2527,2690
IAD77,2876,2001,2583,2758,2588
PDX79,3278,2095,2874,2407,2473
SIN51,2493,2554,1815,2656,2450

*----------------------Concat Dataframe---------------------*

In [3]:
c_weather = pd.DataFrame({
    'City':['Toronto','Ottawa','North York'],
    'Temperature':[25,28,30], 
    'Humidity':[45,50,55]
})

c_weather

         City  Temperature  Humidity
0     Toronto           25        45
1      Ottawa           28        50
2  North York           30        55

In [5]:
a_weather = pd.DataFrame({
    'City':['Richmond','Florida','LA'],
    'Temperature':[20,28,30], 
    'Humidity':[40,55,60]
})
a_weather

       City  Temperature  Humidity
0  Richmond           20        40
1   Florida           28        55
2        LA           30        60

In [6]:
# Concat data frames
df = pd.concat([c_weather,a_weather])

In [7]:
df

         City  Temperature  Humidity
0     Toronto           25        45
1      Ottawa           28        50
2  North York           30        55
0    Richmond           20        40
1     Florida           28        55
2          LA           30        60

In [8]:
# get continue index
df = pd.concat([c_weather,a_weather],ignore_index=True)

In [9]:
df

         City  Temperature  Humidity
0     Toronto           25        45
1      Ottawa           28        50
2  North York           30        55
3    Richmond           20        40
4     Florida           28        55
5          LA           30        60

In [14]:
# Get data from particular dataframe
df = pd.concat([c_weather,a_weather],keys=['Canada','US'])

In [15]:
df

                City  Temperature  Humidity
Canada 0     Toronto           25        45
       1      Ottawa           28        50
       2  North York           30        55
US     0    Richmond           20        40
       1     Florida           28        55
       2          LA           30        60

In [16]:
df.loc['Canada']

         City  Temperature  Humidity
0     Toronto           25        45
1      Ottawa           28        50
2  North York           30        55

In [18]:
c_weather_temp = pd.DataFrame({
    'City':['Toronto','Ottawa','North York'],
    'Temperature':[25,28,30]
},index=[0,1,2])

c_weather_hum = pd.DataFrame({
    'City':['Ottawa','North York'],
    'Humidity':[50,55]
},index=[1,2])

In [20]:
# Append data on side

df1 = pd.concat([c_weather_temp,c_weather_hum],axis=1)

In [21]:
df1

         City  Temperature        City  Humidity
0     Toronto           25         NaN       NaN
1      Ottawa           28      Ottawa      50.0
2  North York           30  North York      55.0

In [23]:
# Append Series on DataFrame
s = pd.Series(['Humid','Dry','Rain'],name='Event')

df2 = pd.concat([c_weather_temp,s],axis=1)

In [24]:
df2

         City  Temperature  Event
0     Toronto           25  Humid
1      Ottawa           28    Dry
2  North York           30   Rain

*----------------------Merge DataFames----------------*

In [25]:
c_temp = pd.DataFrame({
    'City':['Toronto','Ottawa','North York'],
    'Temperature':[25,28,30]
})

c_hum = pd.DataFrame({
    'City':['Toronto','Ottawa','North York'],
    'Humidity':[50,55,45]
})

In [26]:
df3 = pd.merge(c_temp,c_hum,on='City')

In [27]:
df3

         City  Temperature  Humidity
0     Toronto           25        50
1      Ottawa           28        55
2  North York           30        45

In [ ]:
# Paramete for merge

#   pd.merge(left=Dataframe, right=Dataframe, how= type of join, on=Columnname)